ccatanaoan/HomeTempHumidityMonitor/Objects/bin/sketch/ArduCam_ESP8266_FileCapture.ino.cpp
#include <Arduino.h>
#line 1 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
#line 1 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
// ESP8266-12E ArduCAM Mini Camera Server
//
// This program demonstrates using an ArduCAM Mini 2MP camera with an ESP8266-12E module.
// An OV2640 2MP ArduCAM Mini was used with this program.
//
// The program has a web interface that will allow:
//  - storing and viewing of captured jpg files
//  - viewing live streamed video
//  - changing the resolution
//
// Captured jpeg files are stored on the ESP8266-12E built in memory.
//
// The capture and streaming features can be reached directly via the browser by using the format:
//    http://IPaddress/capture - for still capture
//    http://IPaddress/stream  - for streaming video
//
// The captured stills or streamed video can be accessed as an HTML image:
//    <img src="http://IPaddress/capture">
//        or
//    <img src="http://IPaddress/stream">
//
//
//  Wiring diagram to connect ArduCAM to ESP8266-12E
//
//     ArduCAM mini   ->    ESP8266-12E
//         CS         ->        D0
//        MOSI        ->        D7
//        MISC        ->        D6
//         SCK        ->        D5
//         GND        ->       GND
//         VCC        ->       3V3
//         SDA        ->        D2
//         SCL        ->        D1


#include <FS.h> // FOR SPIFFS
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <Wire.h>
#include <ArduCAM.h>
#include <SPI.h>
#include "memorysaver.h"
#if !(defined ESP8266 )
#error Please select the ArduCAM ESP8266 UNO board in the Tools/Board
#endif

//This demo can only work on OV2640_MINI_2MP or ARDUCAM_SHIELD_V2 platform.
#if !(defined (OV2640_MINI_2MP)||(defined (ARDUCAM_SHIELD_V2) && defined (OV2640_CAM)))
#error Please select the hardware platform and camera module in the ../libraries/ArduCAM/memorysaver.h file
#endif

// set GPIO16 as the slave select :
const int CS = 16;

// if the video is chopped or distored, try using a lower value for the buffer
// lower values will have fewer frames per second while streaming
static const size_t bufferSize = 4096; // 4096; //2048; //1024;

static const int fileSpaceOffset = 700000;

static const int wifiType = 0; // 0:Station  1:AP

//AP mode configuration
const char *AP_ssid = "arducam_esp8266";
//Default is no password.If you want to set password,put your password here
const char *AP_password = "APpassword";

//Station mode you should put your ssid and password
const char *ssid = "Rise Above This Home"; // Put your SSID here
const char *password = "SteelReserve"; // Put your PASSWORD here

static IPAddress ip(192, 168, 0, 88); // static IP used for browser access: http://IPaddress
static IPAddress gateway(192, 168, 0, 1);
static IPAddress subnet(255, 255, 255, 0);

const String fName = "res.txt";

int fileTotalKB = 0;
int fileUsedKB = 0; int fileCount = 0;
String errMsg = "";
int imgMode = 0; // 0: stream  1: capture
int resolution = 3;
// resolutions:
// 0 = 160x120
// 1 = 176x144
// 2 = 320x240
// 3 = 352x288
// 4 = 640x480
// 5 = 800x600
// 6 = 1024x768
// 7 = 1280x1024
// 8 = 1600x1200

ESP8266WebServer server(80);

ArduCAM myCAM(OV2640, CS);

/////////////////////////////////////////////////
//   Updates Properties file with resolution  ///
/////////////////////////////////////////////////
#line 102 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void updateDataFile();
#line 123 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void myCAMSaveToSPIFFS();
#line 207 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
bool loadFromSpiffs(String path);
#line 235 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
String getDropDown();
#line 293 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void start_capture();
#line 301 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void camCapture(ArduCAM myCAM);
#line 346 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void serverCapture();
#line 374 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void serverStream();
#line 424 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void handleNotFound();
#line 551 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void setCamResolution(int reso);
#line 606 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void clearData();
#line 625 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void handleSubmit();
#line 679 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void setup();
#line 845 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void loop();
#line 102 "C:\\Users\\Cloyd\\Desktop\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCAM-mini-ESP8266-12E-Camera-Server-master\\ArduCam_ESP8266_FileCapture\\ArduCam_ESP8266_FileCapture.ino"
void updateDataFile()
{

  File f = SPIFFS.open(fName, "w");
  if (!f) {
    Serial.println("prop file open failed");
  }
  else
  {
    Serial.println("====== Writing to prop file =========");

    f.println(resolution);
    Serial.println("Data file updated");
    f.close();
  }

